Show / Hide Table of Contents
Class CalculationSetup
Concrete calculation setup
Inheritance
System.Object
OpenObject
CalculationSetup
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public class CalculationSetup : OpenObject
Constructors
Improve this Doc   View Source
CalculationSetup()
Constructor
Declaration
public CalculationSetup()
Properties
Improve this Doc   View Source
CrossSectionCharacteristics
Cross section charactertistics
Declaration
public bool CrossSectionCharacteristics { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Detailing
Detailing
Declaration
public bool Detailing { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Fatigue
ULS fatigue
Declaration
public bool Fatigue { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
MNKappaDiagram
M-N-κ diagram
Declaration
public bool MNKappaDiagram { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
SlsCrack
SLS crack
Declaration
public bool SlsCrack { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
SlsDeflections
SLS deflections
Declaration
public bool SlsDeflections { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
SlsStiffnesses
SLS stiffnesses
Declaration
public bool SlsStiffnesses { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
SlsStressLimitation
SLS stress limitation
Declaration
public bool SlsStressLimitation { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
UlsDiagram
ULS capacity N-M-M
Declaration
public bool UlsDiagram { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
UlsInteraction
Uls interaction
Declaration
public bool UlsInteraction { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
UlsResponse
ULS response
Declaration
public bool UlsResponse { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
UlsShear
ULS shear
Declaration
public bool UlsShear { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
UlsTorsion
ULS torsion
Declaration
public bool UlsTorsion { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source